Tekla Open API Reference for Tekla Structures 2025
Profile Class
 The Profile class defines the form of a cross section.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Profile
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Profile
<SerializableAttribute>
Public NotInheritable Class Profile
The Profile type exposes the following members.
Constructors
Name | Description
Profile
 Instantiates an empty profile.
Top
Properties
Name | Description
ProfileString
 The profile in human-readable form.
Top
Methods
Name | Description
FormatProfileString
 Formats profile string
ParseProfileString
 Parses profile string
Top
See Also
Reference
Tekla.Structures.Model Namespace